Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: figure:: /_static/hide-column.png :alt: Hide a column
ja: figure:: /_static/hide-column.png :alt: カラムを非表示にする

source: - Sqlite database: ``db.sqlite``
ja: - Sqlite のデータベース: ``db.sqlite``

source: User Mode ~~~~~~~~~
ja: User モード ~~~~~~~~~

source: Note: You need to have at least two days of data to see the graph.
ja: 注:このグラフを生成するには、最低でも2日経過している必要があります。

source: Application API Procedures ==========================
ja: アプリケーションのAPIプロシージャ ==========================

source: Search by start date ~~~~~~~~~~~~~~~~~~~~
ja: 開始日で検索 ~~~~~~~~~~~~~~~~~~~~

source: After selecting a group, the information of the group are synced to the local database if necessary
ja: グループを選択した後は、グループの情報は必要に応じてローカルのデータベースと同期されます。

source: - iCalendar subscription link
ja: - iCal配信のリンク

source: Project creation form
ja: プロジェクト作成フォーム

source: - The destination swim lane
ja: - 宛先スイムレーン

source: Closing Tasks -------------
ja: タスクの完了 -------------

source: - Purpose: **Get the list of possible relations between tasks**
ja: - 用途: **全てのタスク間の関係を取得する**

source: If the user session is already open, execute registered providers that implements ``SessionCheckProviderInterface`` 2.
ja: ユーザーのセッションが既に開かれている場合、``SessionCheckProviderInterface`` を実行します。 2.

source: The `ISO 8601 <http://en.wikipedia.org/wiki/ISO_8601>`__ format is always accepted (YYYY-MM-DD or YYYY_MM_DD).
ja: また、 `ISO 8601 <http://ja.wikipedia.org/wiki/ISO_8601>`__ の、YYYY-MM-DD か、 YYYY_MM_DD形式はいつでも使用可能です。

source: - Push your changes to GitHub
ja: - 変更点をGitHubにプッシュする

source: Folder for uploaded files -------------------------
ja: アップロードされたファイルのフォルダ -------------------------

source: Authentication Architecture ===========================
ja: 認証アーキテクチャ ===========================

source: Managing Swimlanes ------------------
ja: スイムレーンの管理 ------------------

source: MySQL configuration -------------------
ja: MySQL の設定 -------------------

source: - ProjectMetadata: ``$this->projectMetadataModel``
ja: - プロジェクトのメタデータ: ``$this->projectMetadataModel``

source: // LDAP DN for managers
ja: // マネージャーのLDAP 識別名

source: Set to false to skip the verification define('LDAP_SSL_VERIFY', true);
ja: falseにすると検証をスキップします。 define('LDAP_SSL_VERIFY', true);

source: Users and Groups ================
ja: ユーザーとグループ ================

source: - **Test your changes!** Do not introduce regressions.
ja: - **変更箇所のテストを行ってください!** 退化を持ち込まないでください。

source: Note: You can also rename the template file ``config.default.php`` to ``config.php``.
ja: 注意: また、テンプレートファイルを ``config.default.php``から、``config.php``にリネームすることもできます。

source: The procedure is similar for other systems.
ja: 他のシステムでも手順はよく似ています。

source: You can use these commands to run each test suite:
ja: これらのコマンドで各々のテストスイートを実行できます。

source: - Install the Add-on **Lightning** to add calendar support to Thunderbird
ja: - Thunderbirdでカレンダーをサポートするために、 **Lightning** アドオンをインストールする。

source: You should make sure that you give all information to be able to reproduce the problem.
ja: 問題を再現する為に必要な全ての情報を書く必要があります。

source: Choose a name, for example you can use “Kanboard” 5.
ja: 例えば、“Kanboard” のように名前を入力する 5.

source: - Purpose: **Remove a subtask**
ja: - 用途: **サブタスクを削除する**

source: // LDAP attribute for user full name // Example for ActiveDirectory: 'displayname' // Example for OpenLDAP: 'cn' define('LDAP_USER_ATTRIBUTE_FULLNAME', 'cn');
ja: // LDAP 属性のユーザーのフルネーム // ActiveDirectory の例 : 'displayname' // OpenLDAP の例 : 'cn' define('LDAP_USER_ATTRIBUTE_FULLNAME', 'cn');

source: Add new task filters --------------------
ja: 新しいタスクのフィルターを追加する --------------------

source: A form is shown to the user with all pre-filled data before to save the link
ja: リンクを保存する前の、全てのデータが埋められたフォームがユーザーに表示されます。

source: - The header name can be anything, for example ``X-API-Auth``.
ja: - ヘッダー名は何でも良く、例えば ``X-API-Auth`` のようにできます。

source: Performance Measurement ~~~~~~~~~~~~~~~~~~~~~~~
ja: パフォーマンスの測定 ~~~~~~~~~~~~~~~~~~~~~~~

source: // See http://php.net/manual/en/session.configuration.php#ini.session.cookie-lifetime
ja: // http://php.net/manual/ja/session.configuration.php#ini.session.cookie-lifetime も参照のこと

source: You can also disable and change the position of the different swimlanes.
ja: また、別のスイムレーンの位置を変更したり、無効化することもできます。

source: By default Kanboard supports 3 standards mail transports:
ja: デフォルトでは、 Kanboard は3つの標準的なメールの送信をサポートしています:

source: - Tasks created by myself: ``creator:me``
ja: - 自分自身で作成したタスク: ``creator:me``

source: // Enable/disable the reverse proxy authentication define('REVERSE_PROXY_AUTH', false);
ja: // リバースプロキシ認証の有効化/無効化 define('REVERSE_PROXY_AUTH', false);

source: // Enable/disable remember me authentication define('REMEMBER_ME_AUTH', true);
ja: // remembarme認証の有効化/無効化 define('REMEMBER_ME_AUTH', true);

source: - Limits avoid working on too many tasks at the same time
ja: - 同時にあまりにも多くのタスクを処理するのを避けるよう制限します

source: projects:daily-stats Calculate daily statistics for all projects
ja: projects:daily-stats 全てのプロジェクトの毎日の統計を計算する

source: - On the filesystem, the plugin will be located here:
ja: - ファイルシステム上では、プラグインは以下にあります:

source: :ref:`Read the instructions <update-docs>`
ja: :ref:` <update-docs>を参照してください。`

source: User LDAP filter ----------------
ja: ユーザーのLDAPフィルター ----------------

source: A ``.htaccess`` file for Apache and a ``web.config`` file for IIS is included but other web servers have to be configured manually.
ja: Apacheのための ``.htaccess`` ファイルと、IISのための ``web.config`` が含まれますが、それ以外のwebサーバーには手動で設定しなければなりません。

source: If not specified, REMOTE_USER is the default define('REVERSE_PROXY_USER_HEADER', 'REMOTE_USER');
ja: 指定されない場合、 REMOTE_USERがデフォルトとなります。 define('REVERSE_PROXY_USER_HEADER', 'REMOTE_USER');

source: Using Events ============
ja: イベントを使用 ============

source: Exceptions ----------
ja: 例外 ----------

source: - **Your custom URL must answer in less than 1 second**, those requests are synchronous (PHP limitation) and that can slow down the user interface if your script is too slow!
ja: - **カスタムURLの回答までに1秒もかからない** ので、同期(PHPの制限)やスクリプトが遅すぎる場合にユーザーインターフェースでこれらのリクエストが低速化することがあります。

source: figure:: /_static/user-mentions.png :alt: User Mention
ja: figure:: /_static/user-mentions.png :alt: ユーザー間での言及

source: A ``.htaccess`` file and a ``web.config`` file are included for Apache/IIS but other web servers have to be configured manually.
ja: ``.htaccess`` ファイルと、 ``web.config`` ファイルはApache/IIS向けに含まれており、それ以外のwebサーバーには手動で設定しなければならない。

source: Remove Users ------------
ja: ユーザーの削除 ------------

source: // Enable/disable the reverse proxy authentication
ja: // リバースプロキシ認証の有効化/無効化

source: // Enable LDAP authentication (false by default) define('LDAP_AUTH', true);
ja: // LDAP 認証を有効にする (デフォルトは false) define('LDAP_AUTH', true);

source: Each time a group query is executed, all registered group providers are executed.
ja: グループのクエリが実行される都度、全てのグループプロバイダが実行されます。

source: Restart Apache.
ja: Apache を再起動する。

source: +---------------+-------------------------------+ | PHP Extension | Note | +===============+===============================+ | pdo_sqlite | Only if you use Sqlite | +---------------+-------------------------------+ | pdo_mysql | Only if you use Mysql/MariaDB | +---------------+-------------------------------+ | pdo_pgsql | Only if you use Postgres | +---------------+-------------------------------+ | gd | | +---------------+-------------------------------+ | mbstring | | +---------------+-------------------------------+ | openssl | | +---------------+-------------------------------+ | json | | +---------------+-------------------------------+ | hash | | +---------------+-------------------------------+ | ctype | | +---------------+-------------------------------+ | session | | +---------------+-------------------------------+ | filter | | +---------------+-------------------------------+ | xml | | +---------------+-------------------------------+ | SimpleXML | | +---------------+-------------------------------+ | dom | | +---------------+-------------------------------+
ja: +---------------+-------------------------------+ | PHP 拡張 | 注記 | +===============+===============================+ | pdo_sqlite | Sqlite を使用する場合のみ | +---------------+-------------------------------+ | pdo_mysql | Mysql/MariaDB を使用する場合のみ| +---------------+-------------------------------+ | pdo_pgsql | Postgres を使用する場合のみ | +---------------+-------------------------------+ | gd | | +---------------+-------------------------------+ | mbstring | | +---------------+-------------------------------+ | openssl | | +---------------+-------------------------------+ | json | | +---------------+-------------------------------+ | hash | | +---------------+-------------------------------+ | ctype | | +---------------+-------------------------------+ | session | | +---------------+-------------------------------+ | filter | | +---------------+-------------------------------+ | xml | | +---------------+-------------------------------+ | SimpleXML | | +---------------+-------------------------------+ | dom | | +---------------+-------------------------------+

source: Background Workers ==================
ja: バックグラウンドワーカー ==================

source: Manufactory ~~~~~~~~~~~
ja: 生産 ~~~~~~~~~~~

source: - **url** (string, required)
ja: - **url** (string, 必須)

source: - Add a comment log when moving the task between columns
ja: - カラム間でタスクを移動するときにコメントログを追加

source: Restart Apache:
ja: Apache を再起動する:

source: Authentication Providers ========================
ja: 認証プロバイダ ========================

source: Subtask creation:
ja: サブタスクの作成:

source: command [options] [arguments]
ja: 使用方法: コマンド [オプション] [引数]

source: - Purpose: **Move a task to another column or another position**
ja: - 用途: **タスクを別のカラムor別の場所に複製する**

source: Known issues with eAccelerator ------------------------------
ja: eAccelerator で共通の問題 ------------------------------

source: Authorization error -------------------
ja: 認可エラー -------------------

source: The translations must be stored in the file ``plugins/Myplugin/Locale/xx_XX/translations.php`` (replace xx_XX by the language code fr_FR, en_US…).
ja: 翻訳ファイルは ``plugins/Myplugin/Locale/xx_XX/translations.php`` (xx_XX は、fr_FR, en_US…のように言語コードに置き換え) に保存されていなければなりません。

source: All event payloads are in the following format:
ja: 全てのイベントのペイロードは以下の書式です:

source: You can customize your boards according to your business activities:
ja: ビジネスのアクティビティに準じてボードをカスタマイズできる:

source: Examples of authentication providers: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 認証プロバイダの例: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Create a new “Trigger”, choose daily and a time, midnight for example 7.
ja: "トリガー"を作成し、「毎日」と時間帯を、例えば深夜帯になるように選択してください。 7.

source: This file should contain a class ``Plugin`` defined under the namespace ``Kanboard\Plugin\Yourplugin`` and extends ``Kanboard\Core\Plugin\Base``.
ja: このファイルは ``Kanboard\Plugin\Yourplugin`` 名前空間の下に ``Plugin`` クラスの定義を含んでいて、``Kanboard\Core\Plugin\Base`` を拡張しなければなりません。

source: A customized form is shown to the user
ja: カスタマイズされた形でユーザーに表示される

source: The URL is protected using the webhook token and should be called via HTTPS for added security.
ja: URLはwebhookトークンを利用することで保護されており、追加のセキュリティのためにHTTPSを経由して呼び出すべきです。

source: From your Kanboard directory, run the command ``phpunit -c tests/units.mysql.xml``.
ja: Kanboardのディレクトリから、``phpunit -c tests/units.mysql.xml`` コマンドを実行してください。

source: Plugin Hooks ============
ja: プラグインのフック ============

source: Show sub-task estimates (forecast of future work):
ja: サブタスクの見積 (今後の作業の見通し)を表示する:

source: - Purpose: **Update a project**
ja: - Purpose: **プロジェクトをアップデートする**

source: # enable php7
ja: # php7 を有効にする

source: Boards ======
ja: ボード ======

source: - Selenium (optional)
ja: - Selenium (任意)

source: These values represent hours of work and have to be set manually.
ja: これらの値は時間で表され、手動でセットしなければなりません。

source: - Everybody else will have the role “User”
ja: - それ以外のすべての人は “ユーザー” の役割を持ちます

source: Set to false to skip the verification
ja: falseにすると検証をスキップします。

source: - Permissions
ja: - 権限

source: Search by task creator ~~~~~~~~~~~~~~~~~~~~~~
ja: タスク作成者で検索 ~~~~~~~~~~~~~~~~~~~~~~

source: +---------------+---------------------------------------+ | PHP Extension | Note | +===============+=======================================+ | zip | Used to install plugins from web ui | +---------------+---------------------------------------+ | ldap | Only for LDAP integration | +---------------+---------------------------------------+ | curl | Use cURL as HTTP client | +---------------+---------------------------------------+
ja: +---------------+---------------------------------------+ | PHP 拡張| 注記 | +===============+=======================================+ | zip | web uiからプラグインをインストールするのに使用 | +---------------+---------------------------------------+ | ldap | LDAP 統合の場合にのみ必要 | +---------------+---------------------------------------+ | curl | cURLをHTTPクライアントとして使用します | +---------------+---------------------------------------+

source: By default, Kanboard do not log anything.
ja: デフォルトでは、Kanboardは何もログを生成しません。

source: - Purpose: **Check if a timer is started for the given subtask and user**
ja: - 用途: **指定したサブタスクとユーザーがタイマーをスタートしたかチェックする**

source: Characters are not printed to the screen.
ja: パスワードの文字は画面に表示されません。

source: You can copy and paste images directly in Kanboard to save time.
ja: 時間を節約するために、Kanboardに直接画像をコピー・ペーストできます。

source: - Result on success: **comment properties**
ja: - 成功時の返り値: **コメントのプロパティ**

source: However, to be accepted you have to follow those directives:
ja: しかし、以下の指示に従ってください。

source: - You can also generate a personal access token instead of your password
ja: - パスワードの代わりに個人アクセストークンを生成することもできます

source: Note: If you have a 64 bits platform choose “x64” otherwise choose “x86” for 32-bit systems.
ja: 注意: 64 ビット版のプラットフォームでは “x64” を、そうでなければ 32ビットシステム向けの “x86” を選択してください。

source: - Purpose: **Save/update task metadata**
ja: - 用途: **タスクのメタデータの保存/更新**

source: From the command line ~~~~~~~~~~~~~~~~~~~~~
ja: コマンドラインから ~~~~~~~~~~~~~~~~~~~~~

source: Projects ========
ja: プロジェクト ========

source: figure:: /_static/task-lead-cycle-time.png :alt: Lead and cycle time
ja: figure:: /_static/task-lead-cycle-time.png :alt: リードタイム・サイクルタイム

source: The `burn down chart <http://en.wikipedia.org/wiki/Burn_down_chart>`__ is available for each project.
ja: 各プロジェクト毎に、`バーンダウンチャート <http://en.wikipedia.org/wiki/Burn_down_chart>`__ が利用可能です。

source: - Purpose: **Create a new project**
ja: - 用途: **プロジェクトの新規作成**

source: - **comment_id** (integer, required)
ja: - **comment_id** (integer, 必須)

source: - Categories
ja: - カテゴリCategories

source: # Install the windows service
ja: # Windows サービスのインストール

source: - LDAP server: - OpenLDAP - Microsoft Active Directory - Novell eDirectory
ja: - LDAP サーバー: - OpenLDAP - Microsoft Active Directory - Novell eDirectory

source: ``$this->container['api']`` or ``$this->api`` expose an instance of the object ``JsonRPC\Server``.
ja: ``$this->container['api']`` か、 ``$this->api`` がインスタンスのオブジェクト ``JsonRPC\Server`` を示します。

source: What is Kanban?
ja: かんばんとは何か？

source: figure:: /_static/time-into-each-column.png :alt: Time spent into each column
ja: figure:: /_static/time-into-each-column.png :alt: 各カラムの経過時間

source: -u "username:secret" \
ja: -u "*ユーザー名*:*シークレット* \

source: Install Kanboard form ports:
ja: portsからKanboardをインストールする:

source: - Always read the `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`__ and check for breaking changes
ja: - 毎回 `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`__ を読み、大きな変更点を確認する

source: LDAP settings -------------
ja: LDAP の設定 -------------

source: Each user can enable the `two-factor authentication <http://en.wikipedia.org/wiki/Two_factor_authentication>`__.
ja: 個々のユーザーは`二要素認証 <https://ja.wikipedia.org/wiki/%E5%A4%9A%E8%A6%81%E7%B4%A0%E8%AA%8D%E8%A8%BC>`__を有効にできます。

source: - **Lead time**: Time between task creation and completion
ja: - **リードタイム**: タスクがつくられてから、完了するまでの時間

source: // LDAP server port (389 by default) define('LDAP_PORT', 389);
ja: // LDAP のサーバーのポート番号 (デフォルトで 389) define('LDAP_PORT', 389);

source: Coding Standards ================
ja: コーディング規約 ================

source: Task creation:
ja: タスクの作成:

source: The object provided to the method ``register()`` must implement one of the pre-defined authentication interfaces.
ja: オブジェクトが提供する ``register()`` メソッドは定義済み認証インターフェースの一つを実装しなければなりません。

source: - Open a terminal and go to your Kanboard directory (example: ``cd /var/www/kanboard``)
ja: - ターミナルを開き、Kanboardのインストールされたディレクトリに移動する (例: ``cd /var/www/kanboard``)

source: If you would like to install Kanboard outside of the web server document root, you need to create at least these symlinks:
ja: Kanboard をwebサーバーのドキュメントルートの外にインストールしたい場合、少なくともこれらのシンボリックリンクが必要です。

source: - Find comments that contains this title: ``comment:"My comment message"``
ja: - コメントに含まれる内容を検索します: ``comment:"My comment message"``

source: - The web user interface is responsive, this is not prefect but that allows you to quickly check something.
ja: - Web UIは反応が良く、完璧では無くても何かを素早く確認できます。

source: Custom Stylesheet ~~~~~~~~~~~~~~~~~
ja: カスタムスタイルシート ~~~~~~~~~~~~~~~~~

source: Attribute: **movedRange**
ja: 属性: **movedRange**

source: - Kanboard is NOT compatible with Apache ``mod_security``.
ja: - Kanboardは Apacheの ``mod_security`` と互換性がありません。

source: // Mysql/Postgres hostname
ja: // Mysql/Postgres でのホスト名

source: - Anybody can create a private project
ja: - 誰でもプライベートプロジェクトを作成できます。

source: If the end-user enter the text “My group” in the auto-complete box, Kanboard will return all groups that match the pattern: ``(&(objectClass=group)(sAMAccountName=My group*))``.
ja: あなたがエンドユーザーなら、オートコンプリートのボックスに "My group" と入力するとKanboardは ``(&(objectClass=group)(sAMAccountName=My group*))`` にマッチするすべてのグループを返します。

source: - Migrations are defined in the file ``app/Schema/<DatabaseType>.php``
ja: - マイグレーションは ``app/Schema/<DatabaseType>.php`` ファイル内で定義されます。

source: - Display sub-tasks in the calendar from the information recorded in the time tracking table.
ja: - 時間追跡テーブルの記録情報から、サブタスクをカレンダーに表示します。

source: - Result on success: **task properties**
ja: - 成功時の返り値: **タスクのプロパティ**

source: // LDAP properties define('LDAP_USER_BASE_DN', 'CN=Users,DC=kanboard,DC=local'); define('LDAP_USER_FILTER', '(&(objectClass=user)(sAMAccountName=%s))');
ja: // LDAP プロパティ define('LDAP_USER_BASE_DN', 'CN=Users,DC=kanboard,DC=local'); define('LDAP_USER_FILTER', '(&(objectClass=user)(sAMAccountName=%s))');

source: - This method will install the **current development version**, use at your own risk.
ja: - この方法は **現在開発中のバージョン** をインストールするため、自己責任で使用してください。

source: Custom Group Providers ======================
ja: カスタムグループのプロバイダ ======================

source: - Greater than: **due:>2015-06-29**
ja: - 指定日より後: **due:>2015-06-29**

source: - You can also use the keyboard shortcut **"v l"** to switch to the list view.
ja: - また、**"v l"** のショートカットキーでリストビューに切り替えられます。

source: - Purpose: **Remove all files associated to a project**
ja: - 用途: **プロジェクトに関連する全てのファイルを削除する**

source: There are two types of API access:
ja: APIアクセスには2つのタイプがあります:

source: Here an example to create a project and a task:
ja: これはプロジェクトとタスクを作成する例です:

source: - Start the worker with the Kanboard command line tool: ``./cli worker``
ja: - Kanboardのコマンドラインツールからワーカーを開始するには: ``./cli worker``

source: - **project_id** (integer, required)
ja: - **project_id** (integer, 必須)

source: If you are not able to setup correctly the LDAP authentication, you can enable the debug mode and watch log files.
ja: LDAP認証が正しくセットアップできない場合、デバッグモードを有効にして、ログファイルを見ることができます。

source: `My link title <https://kanboard.org/>`__
ja: `リンクのタイトル <https://kanboard.org/>`__

source: If you would like to use Unix socket connection, try this:
ja: Unix socket接続を使用したいなら、下記を試してください:

source: -n, --no-interaction Do not ask any interactive question
ja: -n, --no-interaction 対話的な質問をしない

source: - Define action parameters: **Column = Work in progress**
ja: - アクションのパラメータ: **カラム = Work in progress** を定義

source: In this way, when you upgrade Kanboard to another version, the database schema is updated for you.
ja: この方法では、Kanboardを別のバージョンにアップグレードする時、データベースのスキーマはあなたのためにアップデートされます。

source: Removing a project removes all tasks that belong to this project.
ja: プロジェクトを削除すると、そのプロジェクト内の全てのタスクも削除されます。

source: - Result on success: **category properties**
ja: - 成功時の返り値: *カテゴリのプロパティ**

source: Missing translations are commented with ``//`` and the values are empty, just fill blank and remove the comment 3.
ja: 未翻訳部分は``//`` でコメントアウトされて値が空なので、その部分を翻訳してコメントアウトを解除する。 3.

source: Result ~~~~~~
ja: 結果 ~~~~~~

source: Add a New User --------------
ja: 新規ユーザーの追加 --------------

source: // Header name to use for the username define('REVERSE_PROXY_USER_HEADER', 'REMOTE_USER');
ja: // ユーザー名に使用するヘッダ名 define('REVERSE_PROXY_USER_HEADER', 'REMOTE_USER');

source: The first step is to create a database on your MySQL server.
ja: 最初のステップで、MySQLサーバー上にデータベースを作成します。

source: - Disable this option if you don’t use time tracking.
ja: - 時間追跡を利用しない場合、このオプションを無効にしてください。

source: - **blocks** \| is blocked by
ja: - **次をブロックしています** \| 次にブロックされています

source: Attribute: **due**
ja: 属性: **due**

source: - **Always make a backup of your data before upgrading**
ja: - **アップグレードする前に毎回データフォルダのバックアップを取る**

source: - **action_name** (string, required)
ja: - **action_name** (string, 必須)

source: This workflow is managed by the class ``Kanboard\Core\Security\AuthenticationManager``.
ja: このワークフローは ``Kanboard\Core\Security\AuthenticationManager`` クラスで管理されています。

source: - Change the category based on an external label
ja: - カテゴリを外部サービスに基いて変更

source: Task Time Tracking ------------------
ja: タスクの時間追跡 ------------------

source: All string formats supported by the ``strtotime()`` function are supported, for example ``next Thursday``, ``-2 days``, ``+2 months``, ``tomorrow``, etc.
ja: 全ての文字列フォーマットは ``strtotime()`` 関数をサポートしており、例えば``next Thursday``, ``-2 days``, ``+2 months``, ``tomorrow`` 等があります。

source: // db: session information is stored inside the database (default)
ja: // db: セッション情報はデータベース内に保存される(デフォルト)

source: - Find tasks by column name: ``column:"Work in progress"``
ja: - カラム名で検索: ``column:"Work in progress"``

source: As administrator, go to the user profile and click on “Unlock this user”.
ja: 管理者は当該ユーザーのプロフィールを開いて “Unlock this user” をクリックしてください。

source: LDAP Configuration Parameters =============================
ja: LDAP 設定パラメータ =============================

source: - Put your Kanboard instance in “maintenance mode” to avoid people using the software while you are altering the database schema
ja: - データベーススキーマの変更中にソフトウェアをユーザーに使用されるのを避けるため、Kanboardインスタンスを"メンテナンスモード"に置く

source: Edit the crontab of your web server user:
ja: webサーバーのユーザーのcrontabを編集する:

source: figure:: /_static/subtask-status-inprogress.png :alt: Subtask in progress
ja: figure:: /_static/subtask-status-inprogress.png :alt: サブタスクは進行中

source: - Move the task to another column when assignee is cleared
ja: - ユーザーの割当てがなくなったらタスクを他のカラムに移動

source: Default categories for new projects ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 新しいプロジェクトのデフォルトのカテゴリ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: If the resource is for a project (board, task…):
ja: リソースがプロジェクト (ボード、タスク…)の場合:

source: Why there is no official native mobile application?
ja: なぜ公式にネイティブなモバイルアプリケーションが無いのですか?

source: - Set user language from LDAP attribute
ja: - LDAP属性からユーザーの言語を設定

source: figure:: /_static/average-lead-cycle-time.png :alt: Average time spent into each column
ja: figure:: /_static/average-lead-cycle-time.png :alt: 各カラムでの平均経過時間

source: - **id** (integer, required)
ja: - **id** (integer, 必須)

source: Application API ~~~~~~~~~~~~~~~
ja: アプリケーション API ~~~~~~~~~~~~~~~

source: Most likely we won’t want to validate the server cert, and we DON’T want TLS.
ja: だいたいの場合はサーバー証明書の検証をしたくないので、TLSを使用したくありません。
